madhephaestus/WiiChuck/ESP8266_AT_Client/ESP8266_AT_Client.cpp
boolean ESP8266_AT_Client::connectUDP(const char *host, uint16_t port){
  boolean ret = false;
  if(connect(host, port, ESP8266_UDP)){
    ret = true;
  }
  return ret;  
}

boolean ESP8266_AT_Client::setMacAddress(uint8_t * mac_address){
  boolean ret = false;
  char mac_str[18] = {0};
  macArrayToString(mac_address, (char *) mac_str);
  
  if(strlen(mac_str) == 17){ // e.g. 00:04:4a:23:11:7b
    flushInput();
    stream->print("AT+CIPSTAMAC_CUR=\"");
    stream->print(mac_str);
    stream->print("\"\r\n");

    clearTargetMatchArray();
    addStringToTargetMatchList("OK");
    addStringToTargetMatchList("WIFI DISCONNECT");    
    addStringToTargetMatchList("WIFI CONNECTED");    
    addStringToTargetMatchList("WIFI GOT IP"); 
    uint8_t match_index = 0xFF;
    while(readStreamUntil(&match_index, 5000)){
      if(match_index == 0){
        ret = true;
      }
    }
  }
  
  return ret;
}

// 0 : disable sleep mode
// 1 : light-sleep mode
// 2 : modem-sleep mode 
boolean ESP8266_AT_Client::sleep(uint8_t mode){
  boolean ret = false;
  stream->print("AT+SLEEP=");
  stream->print(mode);
  stream->print("\r\n");
  
  if(readStreamUntil("OK", 100)){
    ret = true;
  }
  
  return ret;
}

// note dnsServer is currently ignored as there is no direct support for it in the AT command set, afaict
// at any rate, we are currently *emulating* DNS in this library, not actually sending explicit DNS requests to a name server
boolean ESP8266_AT_Client::setStaticIPAddress(uint32_t ipAddress, uint32_t netMask, uint32_t defaultGateway, uint32_t dnsServer){
  boolean ret = false;
  char ip_str[16] = {0};
  char netMask_str[16] = {0};
  char defaultGateway_str[16] = {0};
  char dnsServer_str[16] = {0};
  
  IpUint32ToString(ipAddress, (char *) ip_str);
  IpUint32ToString(netMask, (char *) netMask_str);
  IpUint32ToString(defaultGateway, (char *) defaultGateway_str);
  IpUint32ToString(dnsServer, (char *) dnsServer_str);
  
  stream->print("AT+CIPSTA_CUR=\"");
  stream->print((char *) ip_str);
  stream->print("\",\"");
  stream->print((char *) defaultGateway_str);
  stream->print("\",\"");
  stream->print((char *) netMask_str);
  stream->print("\"\r\n");

  if(readStreamUntil("OK", 1000)){
    ret = true;
  }
  
  return ret;
}

boolean ESP8266_AT_Client::setDHCP(void){
  boolean ret = false;
  stream->print("AT+CWDHCP_CUR=1,1\r\n");
  
  clearTargetMatchArray();
  addStringToTargetMatchList("OK");
  addStringToTargetMatchList("WIFI GOT IP");  
  uint8_t match_index = 0xff;
  while(readStreamUntil(&match_index, 2000)){
    ret = true;
  }
  
  return ret;
}

/** Write a character in request
	@param c			Character to write
	@return 1 if a character was sent 0 otherwise
 */
size_t ESP8266_AT_Client::write(uint8_t c){
  uint8_t buf[1] = {c};
  return write(buf, 1);
}

/** Write a characters buffer in request
	@param buf    a buffer of bytes to send
	@param sz     the number of bytes in the buffer
	@return sz if buf was sent 0 otherwise
 */
size_t ESP8266_AT_Client::write(const uint8_t *buf, size_t sz){
  size_t ret = 0;
  
  stream->print("AT+CIPSEND=");
  stream->print(sz);
  stream->print("\r\n");

  if(readStreamUntil(">", 1000)){  
    ret = stream->write(buf, sz); // pass it along    
    
    if(readStreamUntil("SEND OK\r\n", 1000)){
       ESP8266_DEBUG("Send succeeded");     
    }
  }
  
  return ret;
}

/** Check if there is data pending receipt
	@return 1 if exists, 0 if not exists
 */
int ESP8266_AT_Client::available(){
  // an intent to read() is always preceded by a call to available(),
  // if the caller knows what is good for them,
  // so this is where we need to perform the receive 
  // in a synchronous manner (with timeout)
  
  // some state management needs to be encapsulated here as we'll only read one
  // packet in at a time and we'll keep a 1500 byte buffer around to store
  // the buffered data, hey maybe we can even implement peek correctly
  int ret = num_consumed_bytes_in_input_buffer;  
  
  if(socket_connected){
    receive(); // doesn't really matter what the response is
    ret = num_consumed_bytes_in_input_buffer;   
  }

  return ret;
}

/** Read a character from stream
	@return character
 */
int ESP8266_AT_Client::read(){
  return readFromInputBuffer();
}

/** Read from stream and copy size specified to buffer
	@param buf			Buffer		
	@param size			Buffer size
	@return bytes read
 */
int ESP8266_AT_Client::read(uint8_t *buf, size_t size){
  int num_bytes_to_read = size;
  if(num_consumed_bytes_in_input_buffer < num_bytes_to_read){
    num_bytes_to_read = num_consumed_bytes_in_input_buffer;
  }
  
  for(int ii = 0; ii < num_bytes_to_read; ii++){
    *buf++ = readFromInputBuffer();
  }
  
  return num_bytes_to_read;
}

/** Read a character from response buffer but does not move the pointer.
	@returns *input_buffer_read_ptr
 */
int ESP8266_AT_Client::peek(){
  return *input_buffer_read_ptr;
}

/** Flush response buffer
 */
void ESP8266_AT_Client::flush(){
  stream->flush();
}

/** Stop client
 */
void ESP8266_AT_Client::stop(){
  if(socket_connected || (socket_type == ESP8266_UDP)){

    // set up an AT command and send it
    // then return whether or not it succeeded
    
    flushInput();
    stream->print("AT+CIPCLOSE");
    stream->print("\r\n");   
    
    // ESP8266 responds with either "OK", "ERROR"
    clearTargetMatchArray();
    addStringToTargetMatchList("CLOSED");
    addStringToTargetMatchList("ERROR");

    uint8_t match_index = 0xFF;        
    if(readStreamUntil(&match_index, 5000)){
       if(match_index == 0){ // got "CLOSED"
         ESP8266_DEBUG("Close Succeeded");
       }  
       else{       
         ESP8266_DEBUG("Close Failed");
       }     
    }
    
  }
    
  readStreamUntil("OK", 100);
    
  socket_connected = false;  
}

/** Check if connected to server
	@return 1 if connected
 */

uint8_t ESP8266_AT_Client::connected(){
  return connected(true);
} 

// returns true *only* if the requested SSID is found
// if multiples of the SSID are found, the one with the highest RSSI is returned
boolean ESP8266_AT_Client::scanForAccessPoint(char * ssid, ap_scan_result_t * result, uint8_t * num_results_found, uint32_t timeout_ms){
  boolean ret = false;
  int8_t max_rssi = -128;
  clearTargetMatchArray();
  addStringToTargetMatchList("+CWLAP:(");
  addStringToTargetMatchList(")\r\n");
  addStringToTargetMatchList("OK\r\n");
  
  stream->print("AT+CWLAP");
  stream->print("\r\n");    
  
  uint8_t match_index = 0xFF;
  char line[128] = {0};
  uint8_t result_number = 0;
  
  while(readStreamUntil((uint8_t *) &match_index, &(line[0]), 128, timeout_ms)){
    if(match_index == 1){ // got )      
      ap_scan_result_t res = {0};
      parseScanResult(&res, line);      
      memset((char *) line, 0, 128);
      result_number++;     
      if((strcmp(&(res.ssid[0]), ssid) == 0) && (res.rssi > max_rssi)){
        *result = res;
        max_rssi = res.rssi;
        ret = true;
      }
    }
    else if(match_index == 2){
      break;
    }
  }
  
