madhephaestus/WiiChuck/ESP8266_AT_Client/ESP8266_AT_Client.cpp
  *num_results_found = result_number;  
  
  return ret;
}

// returns true if *any* SSIDs are found
boolean ESP8266_AT_Client::scanAccessPoints(ap_scan_result_t * results, uint8_t max_num_results, uint8_t * num_results_found, uint32_t timeout_ms){
  boolean ret = false;
    
  clearTargetMatchArray();
  addStringToTargetMatchList("+CWLAP:(");
  addStringToTargetMatchList(")\r\n");
  addStringToTargetMatchList("OK\r\n");
  
  stream->print("AT+CWLAP");
  stream->print("\r\n");    
  
  uint8_t match_index = 0xFF;
  char line[128] = {0};
  uint8_t result_number = 0;
  
  while(readStreamUntil((uint8_t *) &match_index, &(line[0]), 128, timeout_ms)){
    ret = true;
    
    if(match_index == 1){ // got )
      if(result_number < max_num_results){
        parseScanResult(&(results[result_number]), line);
        memset((char *) line, 0, 128);
      }
      result_number++;      
    }
    else if(match_index == 2){
      break;
    }
  }
  
  *num_results_found = result_number;
     
  return ret;
}

void ESP8266_AT_Client::parseScanResult(ap_scan_result_t * result, char * line){
  // tokenize the line on commas
  result->security = 0;
  memset(&(result->ssid[0]), 0, 32);
  result->rssi = -128;
  memset(&(result->mac[0]), 0, 6);
  
  char * token = strtok(line, ",");
  uint8_t token_number = 0;
  uint8_t len = 0;
  while(token != NULL){
    switch(token_number){
    case 0:
      result->security = atoi(token);
      break;
    case 1: 
      // ssid is quoted
      len = strlen(token);
      if((len <= 32) && (token[0] == '\"') && (token[len - 1] == '\"')){
        token[len - 1] = NULL;
        strncpy(&(result->ssid[0]), &(token[1]), 33);         
      }
      break;
    case 2:
      result->rssi = atoi(token);
      break;
    case 3: 
      // mac address is quoted
      len = strlen(token);
      if((len <= 32) && (token[0] == '\"') && (token[len - 1] == '\"')){      
        token[len - 1] = NULL;
        stringToMacArray(&(token[1]), &(result->mac[0])); 
        break;
      }
      break;    
    default:
      break;      
    }
    token = strtok(NULL, ",");
    token_number++;
  }  
}

boolean ESP8266_AT_Client::getRemoteIp(uint32_t * ip){
  boolean ret = false;
  
  clearTargetMatchArray();
  addStringToTargetMatchList("STATUS:2");   // got ip    
  addStringToTargetMatchList("STATUS:3");   // connected
  addStringToTargetMatchList("STATUS:4");   // disconnected 
  addStringToTargetMatchList("OK\r\n");
  
  stream->print("AT+CIPSTATUS");
  stream->print("\r\n");    
     
  uint8_t match_index = 0xFF;      
  if(readStreamUntil(&match_index, 100)){
    if((match_index == 0) || (match_index == 1) || ((match_index == 2) && (socket_type == ESP8266_UDP))){
      if(readStreamUntil("+CIPSTATUS:", 100)){
        // we'll see three quotation marks before we reach the Remote IP address
        if(readStreamUntil("\"", 100) && readStreamUntil("\"", 100) && readStreamUntil("\"", 100)){          
          char remote_ip_str[16] = {0};
          if(readStreamUntil("\"", &(remote_ip_str[0]), 16, 100)){            
            ret = stringToIpUint32((char *) remote_ip_str, ip);
            readStreamUntil("OK\r\n", 100);
          }
        }
      }
    }
  } 
  
  return ret;
}
 
uint8_t ESP8266_AT_Client::connected(boolean actively_check){
  uint8_t ret = 1; // assume we are connected
  if(!socket_connected){
    return 0;
  }
  
  if(socket_connected && actively_check){
    // set up an AT command and send it
    // then return whether or not it succeeded

    clearTargetMatchArray();
    addStringToTargetMatchList("STATUS:2"); // got ip    
    addStringToTargetMatchList("STATUS:3"); // connected
    addStringToTargetMatchList("STATUS:4"); // disconnected
    addStringToTargetMatchList("OK\r\n");  
    addStringToTargetMatchList("+IPD,");    
        
    // you have to get "STATUS:" and a numeric code
    // then you have *may* get "+CIPSTATUS:"
    // then you get "OK" 
    if(num_characters_remaining_to_receive > 0){
      receive(true); // receive is already in progress    
    }
    else{    
      stream->print("AT+CIPSTATUS");
      stream->print("\r\n");  
        
      uint8_t match_index = 0xFF;      
      if(readStreamUntil(&match_index, 100)){      
        switch(match_index){
        case 2: //disconnected
          if(socket_type == ESP8266_TCP){
            socket_connected = false;      
            ret = 0;
          }   
          break;
        case 4: // +IPD, gotta deal with it
          receive(true);
          break;
        case 0: 
        case 1:
        case 3:
        default:
           // nothing to do
          break;
        }                             
      }          
      
      if(match_index != 3){ 
        if(readStreamUntil(&match_index, 100)){
          if(match_index != 3){ //  != "OK"
             ESP8266_DEBUG("CIPSTATUS not OK"); 
             // doesn't necessarily mean we're disconnected
          }
        }
        else{
          ESP8266_DEBUG("AT+CIPSTATUS expected OK, but didn't receive it");
        }          
      }  
    }  

  }  
  
  return ret;
}

uint8_t ESP8266_AT_Client::connectedToNetwork(void){
  uint8_t ret = 0; 

  clearTargetMatchArray();  
  addStringToTargetMatchList("+CWJAP_CUR:"); // connected
  addStringToTargetMatchList("No AP"); // disconnected
  addStringToTargetMatchList("OK\r\n");    
  
  stream->print("AT+CWJAP_CUR?");
  stream->print("\r\n");  
  
  uint8_t match_index = 0xFF;  
  while(readStreamUntil(&match_index, 500)){   
    if(match_index == 0){
      ret = 1;
    }
    
    if(match_index == 2){
      break;
    }
  }
  
  return ret;  
}

boolean ESP8266_AT_Client::getIPAddress(char * ip_str, char * gateway_str, char * netmask_str){
  boolean ret = false;
  
  clearTargetMatchArray();
  addStringToTargetMatchList("+CIPSTA:ip:\"");
  addStringToTargetMatchList("+CIPSTA:gateway:\"");
  addStringToTargetMatchList("+CIPSTA:netmask:\"");    
  addStringToTargetMatchList("\""); // this is tricky, since it's a subset of other match strings, it must come after them
  addStringToTargetMatchList("OK\r\n");       
  
  flushInput();
  stream->print("AT+CIPSTA?");
  stream->print("\r\n");    
  
  uint8_t match_index = 0xFF;  
  char tmp[32] = {0};
  uint8_t which_ip = 0xFF; // 0 for ip, 1 for gateway, 2 for netmask
  while(readStreamUntil(&match_index, &(tmp[0]), 32, 100)){       
    ret = true;   
    if((which_ip < 3) && (match_index == 3) && (strlen(tmp) <= 15)){
      switch(which_ip){
      case 0: 
        strcpy(ip_str, tmp); 
        break;
      case 1: 
        strcpy(gateway_str, tmp); 
        break;
      case 2: 
        strcpy(netmask_str, tmp); 
        break;
      default: break;
      }
    }
    
    which_ip = 0xFF;
    if(match_index < 3){
      which_ip = match_index;
      memset(tmp, 0, 32);
    }
    
