madhephaestus/WiiChuck/ESP8266_AT_Client/ESP8266_AT_Client.cpp
    if(match_index == 4){
      break;
    }    
  }
  
  return ret;
}

uint32_t ESP8266_AT_Client::IpArrayToIpUint32(uint8_t * ip){
  uint32_t ret = 0;
  ret |= ((uint32_t) ip[0]) << 24;
  ret |= ((uint32_t) ip[1]) << 16;
  ret |= ((uint32_t) ip[2]) << 8;
  ret |= ((uint32_t) ip[3]) << 0;
  return ret;
}

void ESP8266_AT_Client::IpUint32ToArray(uint32_t ip, uint8_t * ip_arr){
  ip_arr[0] = (ip >> 24) & 0xff;
  ip_arr[1] = (ip >> 16) & 0xff;
  ip_arr[2] = (ip >> 8) & 0xff;
  ip_arr[3] = (ip >> 0) & 0xff;  
}

boolean ESP8266_AT_Client::stringToIpArray(char * str, uint8_t * ip){
  uint32_t ip_u32 = 0;
  boolean ret = false;
  if(stringToIpUint32(str, &ip_u32)){
    IpUint32ToArray(ip_u32, ip);
    ret = true;
  }
  return ret;
}

void ESP8266_AT_Client::IpArrayToString(uint8_t * ip, char * tgt){
  uint32_t ip_u32 = IpArrayToIpUint32(ip);
  IpUint32ToString(ip_u32, tgt);
}

void ESP8266_AT_Client::IpUint32ToString(uint32_t ip, char * tgt){
  sprintf(tgt, "%d.%d.%d.%d",
    (uint8_t) (ip >> 24),
    (uint8_t) (ip >> 16),
    (uint8_t) (ip >> 8),
    (uint8_t) (ip >> 0));    
}

boolean ESP8266_AT_Client::stringToIpUint32(char * str, uint32_t * ip){
  char * token = strtok(str, ".");
  uint8_t num_tokens = 0;
  uint32_t ip_address = 0;
  boolean ret = false;
  
  while(token != NULL){
    num_tokens++;
   
    if(num_tokens > 4){
      break;
    }
    
    if(num_tokens > 1){
      ip_address <<= 8;      
    }      
    ip_address |= atoi(token) & 0xFF;
    
    token = strtok(NULL, ".");
  }
  
  if(num_tokens == 4){
    ret = true;
    *ip = ip_address;
  }
  
  return ret;
}

void ESP8266_AT_Client::macArrayToString(uint8_t * mac, char * tgt){
  sprintf(tgt, "%02X:%02X:%02X:%02X:%02X:%02X",
    mac[0],
    mac[1],
    mac[2],
    mac[3],
    mac[4],
    mac[5]);
}

boolean ESP8266_AT_Client::stringToMacArray(char * str, uint8_t * mac){
  boolean ret = false;
  char * token = strtok(str, ":");
  uint8_t num_tokens = 0;
  uint32_t ip_address = 0;
  char local_mac[6] = {0};
  
  while(token != NULL){
    num_tokens++;
    if(num_tokens > 6){
      break;
    }
    
    if(strlen(token) == 2){
      char * temp = NULL;
      uint32_t octet = strtoul((char *) token, &temp, 16);
      if (*temp == '\0'){         
        local_mac[num_tokens-1] = octet;
      }
      else{
        break;
      }         
    }
    else{
      break;
    }
    
    token = strtok(NULL, ":");
  }
  
  if(num_tokens == 6){
    ret = true;
    memcpy(mac, local_mac, 6);
  }      
  return ret;
}

boolean ESP8266_AT_Client::getIPAddress(uint32_t * ip, uint32_t * gateway, uint32_t * netmask){
  boolean ret = false;
  char ip_str[16] = {0};
  char gateway_str[16] = {0};
  char netmask_str[16] = {0};
  ret = getIPAddress((char *) &(ip_str[0]), (char *) &(gateway_str[0]), (char *) &(netmask_str[0]));
  if(ret){
    stringToIpUint32((char *) &(ip_str[0]), ip);
    stringToIpUint32((char *) &(gateway_str[0]), gateway); 
    stringToIpUint32((char *) &(netmask_str[0]), netmask);     
  }
  
  return ret;
}

boolean ESP8266_AT_Client::getMacAddress(char * mac_str){
  boolean ret = false;
  
  clearTargetMatchArray();
  addStringToTargetMatchList("+CIFSR:STAMAC,\""); // connected
  addStringToTargetMatchList("OK\r\n");    
  addStringToTargetMatchList("ERROR\r\n");    
  
  flushInput();
  stream->print("AT+CIFSR");
  stream->print("\r\n"); 
  
  uint8_t match_index = 0xFF;
  if(readStreamUntil(&match_index, 100)){   
    if(match_index == 0){
      char tmp[32] = {0};
      if(readStreamUntil("\"", &(tmp[0]), 32, 10)){
        strncpy(mac_str, tmp, 18); // an mac address is at most 17 characters
        ret = true;
      }
      
      readStreamUntil("OK", 100); // clear out the OK   
    }
  }
  else{
    // Timeout
  }
  
  return ret;  
}

boolean ESP8266_AT_Client::getMacAddress(uint8_t * mac){
  boolean ret = false;
  char tmp[18] = {0};  
  if(getMacAddress((char *) tmp)){
    ret = stringToMacArray((char *) tmp, mac);
  }

  return ret;
}

boolean ESP8266_AT_Client::getHostByName(const char *hostname, uint32_t *ip, uint32_t timeout_ms){
  // connect to host name on port 7
  // then read the connection status to get teh remote IPAddress
  boolean ret = false;
  
  socket_type = ESP8266_UDP;
  
  stream->print("AT+CIPSTART=\"UDP\",\"");
  stream->print(hostname);
  stream->print("\",7\r\n");
  
  if(readStreamUntil("OK", timeout_ms)){     
    uint32_t remote_ip = 0;
    ret = getRemoteIp(&remote_ip);    
    if(ret){
      *ip = remote_ip;
    }
  }
  
  stop();
  
  return ret;
}

ESP8266_AT_Client::operator bool(){
  return (connected()==1);
}


/** Adds str to list safely
	@param list			
	@param str	
	@param max_num_entries 
	@return returns true if the item is successfully added and false otherwise
 */
boolean ESP8266_AT_Client::addStringToTargetMatchList(char * str){
  uint16_t free_index = 0xFFFF;
  
  if(strlen(str) <= ESP8266_AT_CLIENT_MAX_STRING_LENGTH){
    
    // search the list for an empty space
    // the last empty space must remain empty
    // so don't include it in the search
    for(uint16_t ii = 0; ii < ESP8266_AT_CLIENT_MAX_NUM_TARGET_MATCHES; ii++){      
      uint16_t len = strlen(&(target_match_array[ii][0]));  
      if(0 == len){
        free_index = ii;
        break;
      }
    }
        
    // free index is the first empty space in the list
    // or 0xFFFF if no free entries were found
    
    // if free index points to a viable position
    // then copy the candidate string into that position
    // and limit the number of characters copied
    if(free_index < ESP8266_AT_CLIENT_MAX_NUM_TARGET_MATCHES){         
      char * tgt_addr = &(target_match_array[free_index][0]);
      strncpy(tgt_addr, str, ESP8266_AT_CLIENT_MAX_STRING_LENGTH + 1);  // copy the string in      
      target_match_lengths[free_index] = strlen(tgt_addr);
      return true;
    }
    
  }
  
  return false;
}

// pass in an array of strings to match against
// the list is presumed to be terminated by a NULL string
// this function can only handle up to ESP8266_AT_CLIENT_MAX_NUM_TARGET_MATCHES matching targets
// TODO: this function should get another argument to reset its internal state
//       because the caller decides it failed irrecoverably for some reason it might never recover?
boolean ESP8266_AT_Client::readStreamUntil(uint8_t * match_idx, char * target_buffer, uint16_t target_buffer_length, int32_t timeout_ms){
  boolean match_found = false;
  static boolean initial_call = true;
  static uint16_t local_target_buffer_index = 0;
  static uint8_t match_char_idx[ESP8266_AT_CLIENT_MAX_NUM_TARGET_MATCHES] = {0};  
  unsigned long previousMillis = millis();      
  
#ifdef ESP8266_AT_CLIENT_ENABLE_DEBUG
  if((debugStream != NULL) && debugEnabled){
    ESP8266_DEBUG("+++");
    for(uint8_t ii = 0; ii < ESP8266_AT_CLIENT_MAX_NUM_TARGET_MATCHES; ii++){
      uint16_t target_match_length = target_match_lengths[ii];
      if(target_match_length == 0){ 
        break;
      }
      ESP8266_DEBUG("  Waiting for ", target_match_array[ii]);  
    }
    ESP8266_DEBUG("===");    
  }
#endif  
  
  if(initial_call){
    initial_call = false;
    //debugStream->println("\nbegin>");
  }
  
  while(!match_found){ // until a match is found
    unsigned long currentMillis = millis();
    if((timeout_ms > 0) && (currentMillis - previousMillis >= timeout_ms)){
       break;
    }

