madhephaestus/WiiChuck/ESP8266_AT_Client/ESP8266_AT_Client.cpp
  // wait for connected status
  if(readStreamUntil("WIFI CONNECTED", timeout_ms)){

    ESP8266_DEBUG("Connected to Network"); 
    if(onConnect != NULL){
      onConnect();
    }
    // wait for got IP status
    if(readStreamUntil("WIFI GOT IP", 60000)){
       ESP8266_DEBUG("Got IP"); 
 
       if(readStreamUntil("OK")){
         return true;
       }      
    }
    else{
       ESP8266_DEBUG("Failed to get IP address"); 
       return false;
    }      
  }
  else{  
     ESP8266_DEBUG("Failed to connect to Network");    
     return false;    
  }
  
  return false;
}

//TODO: Implement
boolean ESP8266_AT_Client::disconnectFromNetwork(){
  boolean ret = false;
  
  flushInput();
  stream->print("AT+CWQAP");
  stream->print("\r\n");  
  
  if(readStreamUntil("WIFI DISCONNECT", 1000)){
     ESP8266_DEBUG("Disconnected from Network");    
     ret = true;
  }
  else{
     ESP8266_DEBUG("Failed to disconnect from Network");
  }

  return ret;
}

boolean ESP8266_AT_Client::setTcpKeepAliveInterval(uint16_t _tcp_seconds){
  if(_tcp_seconds <= 7200){
    tcp_keep_alive_interval_seconds = _tcp_seconds;
    return true;
  }
  return false;
}

void ESP8266_AT_Client::receive(boolean delegate_received_IPD){    
  static enum {WAITING_FOR_IPD, WAITING_FOR_IPD_OR_CLOSED, WAITING_FOR_COLON, PROCESSING_IPD} receive_state = WAITING_FOR_IPD;
  uint8_t match_index = 0xFF;
    
  if(num_free_bytes_in_input_buffer == 0){
    // trying to receive more is unproductive until we get rid of some that we alrady have
    return;
  }
  
  if(stream->available() == 0){
    // there's nothing in the hardware buffer to digest
    return;
  }
      
  if(delegate_received_IPD){
    if(receive_state == WAITING_FOR_IPD || receive_state == WAITING_FOR_IPD_OR_CLOSED){
      receive_state = WAITING_FOR_COLON;
      ESP8266_DEBUG("Rx State = WAITING_FOR_COLON (1)");
    }
    else{
      ESP8266_DEBUG("Unexpected delegate call to receive");
    }    
  }  
    
  if(receive_state == WAITING_FOR_IPD){
    clearTargetMatchArray();
    addStringToTargetMatchList("+IPD,");
    addStringToTargetMatchList("OK");
    if(readStreamUntil(&match_index, 10) && (match_index == 0)){
      // we got +IPD,
      receive_state = WAITING_FOR_COLON;
      ESP8266_DEBUG("Rx State = WAITING_FOR_COLON (2)");
    }
  }
  else if(receive_state == WAITING_FOR_IPD_OR_CLOSED){
    clearTargetMatchArray();
    addStringToTargetMatchList("+IPD,");    
    addStringToTargetMatchList("CLOSED");   
    addStringToTargetMatchList("OK");
    if(readStreamUntil(&match_index, 10)){
      if(match_index == 0){      
        // we got +IPD,
        receive_state = WAITING_FOR_COLON;
        ESP8266_DEBUG("Rx State = WAITING_FOR_COLON (3)");
      }
      else if(match_index == 1){
        // we got CLOSED
        socket_connected = false;        
        receive_state = WAITING_FOR_IPD;
        ESP8266_DEBUG("Rx State = WAITING_FOR_IPD");
        return; // we're done here
      }
    }      
  }  
 
  if(receive_state == WAITING_FOR_COLON){
    clearTargetMatchArray();
    addStringToTargetMatchList(":");    
    char tmp[32] = {0};
    if(readStreamUntil(&match_index, &(tmp[0]), 32, 10)){
      if(match_index == 0){
        char * temp = NULL;
        uint32_t num_characters_expected = strtoul((char *) tmp, &temp, 10);
        if (*temp != '\0'){
          ESP8266_DEBUG("Debug: Receive Error, length parse error on ", temp);  
          //TODO: this is a disaster... caller should be able to know about it if it happens
          receive_state = WAITING_FOR_IPD_OR_CLOSED;
          ESP8266_DEBUG("Rx State = WAITING_FOR_IPD_OR_CLOSED (1)");
        }
        else{
          num_characters_remaining_to_receive = num_characters_expected;
          receive_state = PROCESSING_IPD;
          ESP8266_DEBUG("Rx State = PROCESSING_IPD");
        }
      }
    }
  }  
    
  if(receive_state == PROCESSING_IPD){
    ESP8266_DEBUG("Remaining: ", num_characters_remaining_to_receive);
    uint32_t bytes_read_this_cycle = 0;
    while((num_characters_remaining_to_receive > 0) && (num_free_bytes_in_input_buffer > 0) && stream->available()){
      uint8_t ch = stream->read();
      
      bytes_read_this_cycle++;
#ifdef ESP8266_AT_CLIENT_DEBUG_ECHO_EVERYTHING
      if(debugStream != NULL && debugEnabled) debugStream->write(ch);
#endif
      
      if(writeToInputBuffer(ch)){            
        num_characters_remaining_to_receive--;
      }      
      else{
        ESP8266_DEBUG("writeToInputBuffer failed");
        break;
      }
    }
    
    if(num_characters_remaining_to_receive == 0){
      receive_state = WAITING_FOR_IPD_OR_CLOSED;
      ESP8266_DEBUG("Rx State = WAITING_FOR_IPD_OR_CLOSED (2)");
    }    
  }
}

void ESP8266_AT_Client::ESP8266_DEBUG(char * msg){
#ifdef ESP8266_AT_CLIENT_ENABLE_DEBUG
  if((debugStream != NULL) && debugEnabled){       
    debugStream->print("Debug: ");     
    debugStream->println(msg);
    debugStream->flush();
  }
#endif
}

void ESP8266_AT_Client::ESP8266_DEBUG(char * msg, uint16_t value){
#ifdef ESP8266_AT_CLIENT_ENABLE_DEBUG  
  if((debugStream != NULL) && debugEnabled){  
    debugStream->print("Debug: ");     
    debugStream->print(msg);
    debugStream->println(value);
    debugStream->flush();
  }
#endif
}

void ESP8266_AT_Client::ESP8266_DEBUG(char * msg, char * value){
#ifdef ESP8266_AT_CLIENT_ENABLE_DEBUG  
  if((debugStream != NULL) && debugEnabled){  
    debugStream->print("Debug: ");     
    debugStream->print(msg);
    debugStream->print("\"");
    debugStream->print(value);
    debugStream->println("\"");
    debugStream->flush();
  }
#endif
}

void ESP8266_AT_Client::enableDebug(void){
#ifdef ESP8266_AT_CLIENT_ENABLE_DEBUG  
  debugEnabled = true;
#endif  
}

void ESP8266_AT_Client::disableDebug(void){
#ifdef ESP8266_AT_CLIENT_ENABLE_DEBUG  
  debugEnabled = false;
#endif  
}

void ESP8266_AT_Client::clearTargetMatchArray(void){
  for(uint8_t ii = 0; ii < ESP8266_AT_CLIENT_MAX_NUM_TARGET_MATCHES; ii++){
    target_match_array[ii][0] = NULL;
    target_match_lengths[ii] = 0;
  }
}
